"use strict";

module.exports = {
  up: (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert("event", [
      {
        title: "ยินดีต้อนรับผู้ใช้ Follroad ทุกคน",
        description:
          "แนะนำการใช้งาน\r\n- เลื่อนดูแผนที่ โดยคลิกที่แผนที่ค้างแล้วลากเมาส์ ส่วนบนมือถือให้กดค้างแล้วเลื่อน\r\n- ซูมเข้าแผนที่ โดยการใช้ลูกกลิ้งเมาส์ ส่วนบนมือถือให้ใช้สองนิ้วกางขยายออก\r\n- ซูมออกแผนที่ โดยการใช้ลูกกลิ้งเมาส์ ส่วนบนมือถือให้ใช้สองนิ้วหุบเข้าหากัน\r\n- เลื่อนแผนที่ไปตำแหน่งปัจจุบันของคุณ โดยการกดปุ่มสีฟ้ามุมล่างขวา\r\n- แจ้งเหตุการณ์ใหม่ โดยการกดปุ่มสีเขียวมุมล่างขวา แล้วกดเลือกตำแหน่งที่ต้องการบนแผนที่\r\n- เปลี่ยนไปหน้าอื่นๆเช่น ข่าวสารหรือการเดินทาง โดยการกดปุ่มสามขีดมุมบนซ้ายเพื่อเปิดเมนู ส่วนบนมือถือให้ใช้แถบเมนูด้านล่าง\r\n- เข้าสู่ระบบ โดยการกดปุ่ม LOG IN มุมบนขวา\r\n- ค้นหาสถานที่ที่จะไป โดยการพิมพ์ชื่อสถานที่ในช่อง ค้นหาสถานที่\r\n- ในการค้นหาเส้นทาง ถ้าผู้ใช้อนุญาติการใช้ location ระบบจะใช้ตำแหน่งปัจจุบันเป็นค่าเริ่มต้นในการกำหนด สถานที่ต้นทาง\r\n- ในการรับการแจ้งเตือน กรุณาตรวจสอบว่าได้ทำการเปิด รับการแจ้งเตือน ที่หน้าโปรไฟล์ แล้วหรือไม่ (ถ้าเข้าสู่ระบบครั้งแรก การรับแจ้งเตือนจะปิดอยู่)\r\n- สามารถติดตั้งแอปพลิเคชันลงบนอุปกรณ์ได้ โดยการกดปุ่มดาวน์โหลดข้างปุ่มเข้าสู่ระบบ (ยกเว้นเครื่อง IOS ที่จะไม่แสดง ต้องทำที่การตั้งค่าของ browser)\r\n\r\nหากมีข้อเสนอแนะ หรือต้องการติดต่อ สามารถส่ง e-mail มาได้ที่ \r\nrattanan.nan@mail.kmutt.ac.th\r\n* https://seniorproject.sit.kmutt.ac.th/showproject/IT59-BU07",
        latitude: 13.75658136924371,
        longitude: 100.50186437301636,
        type: 13,
        start: "2019-11-18 00:00:00",
        stop: "2020-11-17 00:00:00",
        contributor: "ผู้จัดทำ",
        icon: "event",
        source: "follroad"
      }
    ]);
  },

  down: (queryInterface, Sequelize) => {
    return queryInterface.bulkDelete("event", { contributor: "ผู้จัดทำ" }, {});
  }
};
